Level 06/college_portal/app/controllers/departments_controller.rb

  def create
    @department = Department.new(department_params)
    if @department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ECE"], ["created_at", "2019-11-01 03:14:55.444261"], ["updated_at", "2019-11-01 03:14:55.444261"]]